import copy

start = '집'
end = '은행'
print("-------------[",start,"-->",end,"]--------------")

landscape = {
    '노포': {'범어사':1},
    "범어사":{'노포': 1, '남산': 1},
    "남산" : {'범어사': 1, '두실': 1},
    '두실' : {'남산': 1, '구서': 1},
    "구서" : {'두실': 1, '장전': 1},
    "장전" : {"구서": 1, "부산대": 1},
    "부산대" : {"장전": 1, "온천장": 1},
    "온천장" : {"부산대": 1, "명륜": 1},
    "명륜" : {'온천장': 1, '동래': 1},
    "동래" : {'명륜': 1, '교대': 1, "수안": 1, "미남": 1},
    "교대" : {'동래': 1, '동해동래': 1, "연산": 1, "거제": 1},
    "연산" : {'교대': 1, '거제': 1, '물만골': 1, '시청': 1},
    "시청" : {'연산': 1, '양정': 1},
    "양정" : {'시청': 1, '부전': 1},
    "부전" : {'서면': 1, '양정': 1},
    "서면" : {'부전': 1, '전포': 1, '부암': 1, '범내골': 1},
    "범내골" : {'서면': 1, '범일': 1},
    "범일" : {'범내골': 1, '좌천': 1},
    "좌천" : {'부산진': 1, '범일': 1},
    "부산진" : {'좌천': 1, '초량': 1},
    "초량" : {'부산진': 1, '부산역': 1},
    "부산역" : {'초량': 1, '중앙': 1},
    "중앙" : {'부산역': 1, '남포': 1},
    "남포" : {'중앙': 1, '자갈치': 1},
    "자갈치" : {'남포': 1, '토성': 1},
    "토성" : {'자갈치': 1, '동대신': 1},
    "동대신" : {'토성': 1, '서대신': 1},
    "서대신" : {'동대신': 1, '대티': 1},
    "대티" : {'서대신': 1, '괴정': 1},
    "괴정" : {'대티': 1, '사하': 1},
    "사하" : {'괴정': 1, '당리': 1},
    "당리" : {'사하': 1, '하단': 1},
    "하단" : {'당리': 1, '신평': 1},
    "신평" : {'하단': 1, '동매': 1},
    "동매" : {'신평': 1, '장링': 1},
    "장링" : {'동매': 1, '신장림': 1},
    "신장림" : {'장링': 1, '낫개': 1},
    "낫개" : {'신장림': 1, '다대포항': 1},
    "다대포항" : {'낫개': 1, '다대포해수욕장': 1},
    "다대포해수욕장" : {'다대포항': 1},
    '양산': {'남양산':1},
    '남양산': {'양산':1, '부산대양산캠퍼스':1},
    '부산대양산캠퍼스': {'남양산':1, '증산':1},
    '증산': {'부산대양산캠퍼스':1, '호포':1},
    '호포': {'증산':1, '금곡':1},
    '금곡': {'호포':1, '동원':1},
    '동원': {'금곡':1, '율리':1},
    '율리': {'동원':1, '화명':1},
    '화명': {'율리':1, '수정':1},
    '수정': {'화명':1, '덕천':1},
    '덕천': {'수정':1, '구명':1, '구포':1, '숙등':1},
    '구명': {'덕천':1, '구남':1},
    '구남': {'구명':1, '모라':1},
    '모라': {'구남':1, '모덕':1},
    '모덕': {'모라':1, '덕포':1},
    '덕포': {'모덕':1, '사상':1},
    '사상': {'덕포':1, '감전':1, '괘법르네시떼':1},
    '감전': {'사상':1, '주례':1},
    '주례': {'감전':1, '냉정':1},
    '냉정': {'주례':1, '개금':1},
    '개금': {'냉정':1, '동의대':1},
    '동의대': {'개금':1, '가야':1},
    '가야': {'동의대':1, '부암':1},
    '부암': {'가야':1, '서면':1},
    '전포': {'서면':1, '국제금융센터부산은행':1},
    '국제금융센터부산은행': {'전포':1, '문현':1},
    '문현': {'국제금융센터부산은행':1, '지게골':1},
    '지게골': {'문현':1, '못골':1},
    '못골': {'지게골':1, '대연':1},
    '대연': {'못골':1, '경성대부경대':1},
    '경성대부경대': {'대연':1, '남천':1},
    '남천': {'경성대부경대':1, '금련산':1},
    '금련산': {'남천':1, '광안':1},
    '광안': {'금련산':1, '수영':1},
    '수영': {'광안':1, '민락':1, '망미':1},
    '민락': {'수영':1, '센텀시티':1},
    '센텀시티': {'민락':1, '벡스코':1},
    '벡스코': {'센텀시티':1, '동백':1, '신해운대':1, '센텀':1},
    '동백': {'벡스코':1, '해운대':1},
    '해운대': {'동백':1, '중동':1},
    '중동': {'해운대':1, '장산':1},
    '장산': {'중동':1},
    "대저":{"등구":1,"체육공원":1, "평강":1},
    "체육공원":{"강서구청":1, "대저":1},
    "강서구청":{"구포":1, "체육공원":1},
    "구포":{"덕천":1, "강서구청":1},
    "숙등":{"남산정":1, "덕천":1},
    "남산정":{"만덕":1, "숙등":1},
    "만덕":{"미남":1, "남산정":1},
    "미남":{"사직":1, "만덕":1,"동래":1},
    "사직":{"종합운동장":1, "미남":1},
    "종합운동장":{"거제":1, "사직":1},
    "거제":{"연산":1, "종합운동장":1},
    "물만골":{"배산":1, "연산":1},
    "배산":{"망미":1, "물만골":1},
    "망미":{"수영":1, "배산":1},
    '안평': {'고촌':1},
    '고촌': {'안평':1, '윗반송':1},
    '윗반송': {'고촌':1, '영산대':1},
    '영산대': {'윗반송':1, '석대':1},
    '석대': {'영산대':1, '반여농산물시장':1},
    '반여농산물시장': {'석대':1, '금사':1},
    '금사': {'반여농산물시장':1, '서동':1},
    '서동': {'금사':1, '명장':1},
    '명장': {'서동':1, '충렬사':1},
    '충렬사': {'명장':1, '낙민':1},
    '낙민': {'충렬사':1, '수안':1},
    '수안': {'낙민':1, '동래':1},
    '미남': {'동래':1, '만덕':1, '사직':1},
    "가야대": {"장신대":1},
    "장신대":{"연지공원":1, "가야대":1},
    "연지공원" : {"박물관":1, "장신대":1},
    "박물관":{"수로왕릉":1, "연지공원":1},
    "수로왕릉" : {"봉황":1, "박물관":1},
    "봉황":{"부원":1, "수로왕릉":1},
    "부원":{"김해시청":1, "봉황":1},
    "김해시청":{"인제대":1, "부원":1},
    "인제대":{"김해대학":1, "김해시청":1},
    "김해대학":{"지내":1, "인제대":1},
    "지내":{"불암":1, "김해대학":1},
    "불암":{"대사":1, "지내":1},
    "대사":{"평강":1, "불암":1},
    "평강":{"대저":1, "대사":1},
    "등구":{"덕두":1, "대저":1},
    "덕두":{"공항":1, "등구":1},
    "공항":{"서부산유통지구":1, "덕두":1},
    "서부산유통지구":{"괘법르네시떼":1, "공항":1},
    "괘법르네시떼":{"사상":1, "서부산유통지구":1},
    '태화강' : {'개운포': 1},
    '개운포' : {'태화강': 1, '덕하': 1},
    '덕하' : {'개운포': 1, '망양': 1},
    '망양' : {'덕하': 1, '남창': 1},
    '남창' : {'망양': 1, '서생': 1},
    '서생' : {'남창': 1, '뭘내': 1},
    '뭘내' : {'서생': 1, '좌천': 1},
    '일광' : {'좌천': 1, '동해기장': 1},
    '동해기장' : {'일광': 1, '오시리아': 1},
    '오시리아' : {'동해기장': 1, '송정': 1},
    '송정' : {'오시리아': 1, '신해운대': 1},
    '신해운대' : {'송정': 1, '벡스코': 1},
    '센텀' : {'벡스코': 1, '재송': 1},
    '재송' : {'센텀': 1, '부산원동': 1},
    '부산원동' : {'재송': 1, '안락': 1},
    '안락' : {'부산원동': 1, '동해동래': 1},
    '동해동래' : {'안락': 1, '교대': 1},
    '거제해맞이' : {'거제': 1, '부산': 1},
    '부산' : {'거제해맞이': 1}
}

routing = {}
for place in landscape.keys():
    routing[place] = {'shortestDist':0, 'route':[], 'visited':0}

def visitPlace(visit):
    routing[visit]['visited'] = 1
    for togo, betweenDist in landscape[visit].items():
        toDist = routing[visit]['shortestDist'] + betweenDist
        if(routing[togo]['shortestDist']>=toDist) or not routing[togo]['route']:
            routing[togo]['shortestDist'] = toDist
            routing[togo]['route'] = copy.deepcopy(routing[visit]['route'])
            routing[togo]['route'].append(visit)

visitPlace(start)

while 1:
    minDist = max(routing.values(),key = lambda x:x['shortestDist'])['shortestDist']
    toVisit = ''
    for name, search in routing.items():
        if 0 < search['shortestDist'] <=minDist and not search['visited']:
            minDist = search['shortestDist']
            toVisit=name
    if toVisit == '':
        break
    visitPlace(toVisit)
    print("["+toVisit+"]")
    print("거리 : ",minDist)

print("\n","[",start,"->",end,"]")
print("Route : ",routing[end]['route'])
print("최단거리 : ",routing[end]['shortestDist'])