# 준휘

landscape = {
    "대저":{"등구":1,"체육공원":1, "평강":1},
    "체육공원":{"강서구청":1, "대저":1},
    "강서구청":{"구포":1, "체육공원":1},
    "구포":{"덕천":1, "강서구청":1},
    "덕천":{"숙등":1, "구포":1,"수정":1,"구명":1},
    "숙등":{"남산정":1, "덕천":1},
    "남산정":{"만덕":1, "숙등":1},
    "만덕":{"미남":1, "남산정":1},
    "미남":{"사직":1, "만덕":1,"동래":1},
    "사직":{"종합운동장":1, "미남":1},
    "종합운동장":{"거제":1, "사직":1},
    "거제":{"연산":1, "종합운동장":1},
    "연산":{"물만골":1, "거제":1, "교대":1,"시청":1},
    "물만골":{"배산":1, "연산":1},
    "배산":{"망미":1, "물만골":1},
    "망미":{"수영":1, "배산":1},
    "수영":{"망미":1, "민락":1, "광안":1}
}
