# 준휘

landscape = {
    "가야대": {"장신대":1},
    "장신대":{"연지공원":1, "가야대":1},
    "연지공원" : {"박물관":1, "장신대":1},
    "박물관":{"수로왕릉":1, "연지공원":1},
    "수로왕릉" : {"봉황":1, "박물관":1},
    "봉황":{"부원":1, "수로왕릉":1},
    "부원":{"김해시청":1, "봉황":1},
    "김해시청":{"인제대":1, "부원":1},
    "인제대":{"김해대학":1, "김해시청":1},
    "김해대학":{"지내":1, "인제대":1},
    "지내":{"불암":1, "김해대학":1},
    "불암":{"대사":1, "지내":1},
    "대사":{"평강":1, "불암":1},
    "평강":{"대저":1, "대사":1},
    "대저":{"등구":1,"체육공원":1, "평강":1},
    "등구":{"덕두":1, "대저":1},
    "덕두":{"공항":1, "등구":1},
    "공항":{"서부산유통지구":1, "덕두":1},
    "서부산유통지구":{"괘법르네시떼":1, "공항":1},
    "괘법르네시떼":{"사상":1, "서부산유통지구":1},
    "사상": {"괘법르네시떼": 1, "덕포":1, "감전":1}
}
