# 진환

landscape = {
    '태화강' : {'개운포': 1},
    '개운포' : {'태화강': 1, '덕하': 1},
    '덕하' : {'개운포': 1, '망양': 1},
    '망양' : {'덕하': 1, '남창': 1},
    '남창' : {'망양': 1, '서생': 1},
    '서생' : {'남창': 1, '뭘내': 1},
    '뭘내' : {'서생': 1, '좌천': 1},
    '좌천' : {'뭘내': 1, '일광': 1},
    '일광' : {'좌천': 1, '동해기장': 1},
    '동해기장' : {'일광': 1, '오시리아': 1},
    '오시리아' : {'동해기장': 1, '송정': 1},
    '송정' : {'오시리아': 1, '신해운대': 1},
    '신해운대' : {'송정': 1, '벡스코': 1},
    '벡스코' : {'신해운대': 1, '센텀': 1, '동백': 1, '센텀시티': 1},
    '센텀' : {'벡스코': 1, '재송': 1},
    '재송' : {'센텀': 1, '부산원동': 1},
    '부산원동' : {'재송': 1, '안락': 1},
    '안락' : {'부산원동': 1, '동해동래': 1},
    '동해동래' : {'안락': 1, '교대': 1},
    '교대' : {'동해동래': 1, '거제': 1, '동래': 1, '연산': 1},
    '거제' : {'교대': 1, '거제해맞이': 1},
    '거제해맞이' : {'거제': 1, '부산': 1},
    '부산' : {'거제해맞이': 1}
}
